mdhardenburgh/Blinky/Packages/.cache/NXP.LPC54S016_DFP.12.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmic" Cversion="2.1.0" condition="device.LPC54S016_AND_driver.common">
      <description>DMIC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_dmic.c"/>
        <file category="header" name="drivers/fsl_dmic.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmic_dma" Cversion="2.1.0" condition="device.LPC54S016_AND_driver.dmic_AND_driver.lpc_dma">
      <description>DMIC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_dmic_dma.c"/>
        <file category="header" name="drivers/fsl_dmic_dma.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmic" Cversion="2.1.0" condition="device.LPC54S016_AND_driver.common_AND_driver.dmic">
      <description>DMIC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_dmic.c"/>
        <file category="header" name="drivers/fsl_dmic.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="emc" Cversion="2.0.3" condition="device.LPC54S016_AND_driver.common">
      <description>EMC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_emc.c"/>
        <file category="header" name="drivers/fsl_emc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm" Cversion="2.0.1" condition="device.LPC54S016_AND_driver.common">
      <description>FLEXCOMM Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_flexcomm.c"/>
        <file category="header" name="drivers/fsl_flexcomm.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c" Cversion="2.0.6" condition="device.LPC54S016_AND_driver.common_AND_driver.flexcomm">
      <description>I2C Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_i2c.c"/>
        <file category="header" name="drivers/fsl_i2c.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_dma" Cversion="2.0.6" condition="device.LPC54S016_AND_driver.common_AND_driver.flexcomm_AND_driver.flexcomm_i2c_AND_driver.lpc_dma">
      <description>I2C Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_i2c_dma.c"/>
        <file category="header" name="drivers/fsl_i2c_dma.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_i2s" Cversion="2.1.0" condition="device.LPC54S016_AND_driver.common_AND_driver.flexcomm">
      <description>I2S Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_i2s.c"/>
        <file category="header" name="drivers/fsl_i2s.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_i2s_dma" Cversion="2.1.0" condition="device.LPC54S016_AND_driver.flexcomm_i2s_AND_driver.lpc_dma">
      <description>I2S Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_i2s_dma.c"/>
        <file category="header" name="drivers/fsl_i2s_dma.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi" Cversion="2.0.4" condition="device.LPC54S016_AND_driver.common_AND_driver.flexcomm">
      <description>SPI Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_spi.c"/>
        <file category="header" name="drivers/fsl_spi.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma" Cversion="2.0.4" condition="device.LPC54S016_AND_driver.flexcomm_AND_driver.flexcomm_spi_AND_driver.lpc_dma">
      <description>SPI Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_spi_dma.c"/>
        <file category="header" name="drivers/fsl_spi_dma.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart" Cversion="2.1.0" condition="device.LPC54S016_AND_driver.flexcomm">
      <description>USART Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_usart.c"/>
        <file category="header" name="drivers/fsl_usart.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma" Cversion="2.1.0" condition="device.LPC54S016_AND_driver.flexcomm_AND_driver.flexcomm_usart_AND_driver.lpc_dma">
      <description>USART Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_usart_dma.c"/>
        <file category="header" name="drivers/fsl_usart_dma.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fmeas" Cversion="2.1.0" condition="device.LPC54S016_AND_driver.common">
      <description>FMEAS Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_fmeas.c"/>
        <file category="header" name="drivers/fsl_fmeas.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fro_calib" Cversion="2.0.0" condition="device.LPC54S016_AND_driver.common">
      <description>FRO calibration Lib</description>
      <files>
        <file condition="mdk" category="library" name="arm/keil_lib_fro_calib.lib"/>
        <file category="header" name="drivers/fsl_fro_calib.h"/>
        <file condition="iar" category="library" name="iar/iar_lib_fro_calib.a"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gint" Cversion="2.0.1" condition="device.LPC54S016_AND_driver.common">
      <description>GINT Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_gint.c"/>
        <file category="header" name="drivers/fsl_gint.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iap" Cversion="2.0.2" condition="device.LPC54S016_AND_driver.common">
      <description>IAP Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_iap.c"/>
        <file category="header" name="drivers/fsl_iap.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux" Cversion="2.0.0" condition="device.LPC54S016_AND_driver.common_AND_driver.inputmux_connections">
      <description>INPUTMUX Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_inputmux.c"/>
        <file category="header" name="drivers/fsl_inputmux.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections" Cversion="2.0.1" condition="device.LPC54S016_AND_driver.common">
      <description>Inputmux_connections Driver</description>
      <files>
        <file category="header" name="drivers/fsl_inputmux_connections.h"/>
      </files>
    </component>
